{
    "hola": "¡Hola! ¿En qué puedo ayudarte?",
    "¿como estas?": "Estoy bien, gracias. ¿Y tú?",
    "adiós": "¡Hasta luego!",
    "todo bien": "Todo bien lucho",
    "todo bien?": "aro compae",
    "¿cuál es tu nombre?": "Soy un chatbot creado con FastAPI.",
    "¿qué puedes hacer?": "Puedo responder preguntas y aprender nuevas respuestas.",
    "gracias": "¡De nada! ¿Hay algo más en lo que pueda ayudarte?",
    "¿qué hora es?": "Lo siento, no tengo un reloj conmigo.",
    "¿donde estas?": "Estoy en la nube, listo para ayudarte.",
    "¿cuál es tu color favorito?": "No tengo un color favorito, soy un chatbot.",
    "¿cuál es tu comida favorita?": "No como, pero me gusta ayudar a la gente.",
    "¿cuál es tu película favorita?": "No veo películas, pero me gusta aprender.",
    "¿cuál es tu libro favorito?": "No leo libros, pero me gusta aprender.",
    "¿cuál es tu música favorita?": "No escucho música, pero me gusta aprender.",
    "¿cuál es tu animal favorito?": "No tengo un animal favorito, soy un chatbot.",
    "¿cuál es tu hobby?": "Mi hobby es ayudar a la gente.",
    "¿cuál es tu estación favorita?": "No tengo una estación favorita, soy un chatbot.",
    "¿cuál es tu día favorito?": "No tengo un día favorito, soy un chatbot.",
    "¿cuál es tu mes favorito?": "No tengo un mes favorito, soy un chatbot.",
    "¿cuál es tu año favorito?": "No tengo un año favorito, soy un chatbot.",
    "¿cuál es tu lugar favorito?": "No tengo un lugar favorito, soy un chatbot.",
    "¿cuál es tu país favorito?": "No tengo un país favorito, soy un chatbot.",
    "¿cuál es tu ciudad favorita?": "No tengo una ciudad favorita, soy un chatbot.",
    "¿cuál es tu idioma favorito?": "Me gustan todos los idiomas, soy un chatbot.",
    "¿cuál es tu número favorito?": "No tengo un número favorito, soy un chatbot.",
    "¿cuál es tu letra favorita?": "No tengo una letra favorita, soy un chatbot.",
    "¿cuál es tu palabra favorita?": "No tengo una palabra favorita, soy un chatbot.",
    "¿cuál es tu frase favorita?": "No tengo una frase favorita, soy un chatbot.",
    "¿cuál es tu cita favorita?": "No tengo una cita favorita, soy un chatbot.",
    "¿cuál es tu poema favorito?": "No tengo un poema favorito, soy un chatbot.",
    "¿cuál es tu banda favorita?": "No tengo una banda favorita, soy un chatbot.",
    "¿cuál es tu cantante favorito?": "No tengo un cantante favorito, soy un chatbot.",
    "¿cuál es tu actor favorito?": "No tengo un actor favorito, soy un chatbot.",
    "¿cuál es tu actriz favorita?": "No tengo una actriz favorita, soy un chatbot.",
    "¿cuál es tu director favorito?": "No tengo un director favorito, soy un chatbot.",
    "¿cuál es tu escritor favorito?": "No tengo un escritor favorito, soy un chatbot.",
    "¿cuál es tu pintor favorito?": "No tengo un pintor favorito, soy un chatbot.",
    "¿cuál es tu escultor favorito?": "No tengo un escultor favorito, soy un chatbot.",
    "¿cuál es tu arquitecto favorito?": "No tengo un arquitecto favorito, soy un chatbot.",
    "¿cuál es tu científico favorito?": "No tengo un científico favorito, soy un chatbot.",
    "¿cuál es tu inventor favorito?": "No tengo un inventor favorito, soy un chatbot.",
    "¿cuál es tu filósofo favorito?": "No tengo un filósofo favorito, soy un chatbot.",
    "¿cuál es tu matemático favorito?": "No tengo un matemático favorito, soy un chatbot.",
    "¿cuál es tu físico favorito?": "No tengo un físico favorito, soy un chatbot.",
    "¿cuál es tu químico favorito?": "No tengo un químico favorito, soy un chatbot.",
    "¿cuál es tu biólogo favorito?": "No tengo un biólogo favorito, soy un chatbot.",
    "¿cuál es tu médico favorito?": "No tengo un médico favorito, soy un chatbot.",
    "¿cuál es tu ingeniero favorito?": "No tengo un ingeniero favorito, soy un chatbot.",
    "¿cuál es tu profesor favorito?": "No tengo un profesor favorito, soy un chatbot.",
    "¿cuál es tu maestro favorito?": "No tengo un maestro favorito, soy un chatbot.",
    "¿cuál es tu amigo favorito?": "No tengo un amigo favorito, soy un chatbot.",
    "¿cuál es tu amiga favorita?": "No tengo una amiga favorita, soy un chatbot.",
    "¿cuál es tu familiar favorito?": "No tengo un familiar favorito, soy un chatbot.",
    "¿cuál es tu mascota favorita?": "No tengo una mascota favorita, soy un chatbot.",
    "¿cuál es tu juguete favorito?": "No tengo un juguete favorito, soy un chatbot.",
    "¿cuál es tu juego favorito?": "No tengo un juego favorito, soy un chatbot.",
    "¿cuál es tu videojuego favorito?": "No tengo un videojuego favorito, soy un chatbot.",
    "¿cuál es tu consola favorita?": "No tengo una consola favorita, soy un chatbot.",
    "¿cuál es tu computadora favorita?": "No tengo una computadora favorita, soy un chatbot.",
    "¿cuál es tu teléfono favorito?": "No tengo un teléfono favorito, soy un chatbot.",
    "¿cuál es tu aplicación favorita?": "No tengo una aplicación favorita, soy un chatbot.",
    "¿cuál es tu sitio web favorito?": "No tengo un sitio web favorito, soy un chatbot.",
    "¿cuál es tu red social favorita?": "No tengo una red social favorita, soy un chatbot.",
    "¿cuál es tu blog favorito?": "No tengo un blog favorito, soy un chatbot.",
    "¿cuál es tu foro favorito?": "No tengo un foro favorito, soy un chatbot.",
    "¿cuál es tu canal de YouTube favorito?": "No tengo un canal de YouTube favorito, soy un chatbot.",
    "¿cuál es tu podcast favorito?": "No tengo un podcast favorito, soy un chatbot.",
    "¿cuál es tu programa de televisión favorito?": "No tengo un programa de televisión favorito, soy un chatbot.",
    "¿cuál es tu serie favorita?": "No tengo una serie favorita, soy un chatbot.",
    "¿cuál es tu documental favorito?": "No tengo un documental favorito, soy un chatbot.",
    "¿cuál es tu reality show favorito?": "No tengo un reality show favorito, soy un chatbot.",
    "¿cuál es tu concurso favorito?": "No tengo un concurso favorito, soy un chatbot.",
    "¿cuál es tu evento deportivo favorito?": "No tengo un evento deportivo favorito, soy un chatbot.",
    "¿cuál es tu festival favorito?": "No tengo un festival favorito, soy un chatbot.",
    "¿cuál es tu feria favorita?": "No tengo una feria favorita, soy un chatbot.",
    "¿cuál es tu obra de teatro favorita?": "No tengo una obra de teatro favorita, soy un chatbot.",
    "¿cuál es tu musical favorito?": "No tengo un musical favorito, soy un chatbot.",
    "¿cuál es tu ballet favorito?": "No tengo un ballet favorito, soy un chatbot.",
    "¿cuál es tu danza favorita?": "No tengo una danza favorita, soy un chatbot.",
    "¿cuál es tu canción de cuna favorita?": "No tengo una canción de cuna favorita, soy un chatbot.",
    "¿cuál es tu villancico favorito?": "No tengo un villancico favorito, soy un chatbot.",
    "¿cuál es tu himno favorito?": "No tengo un himno favorito, soy un chatbot.",
    "¿cuál es tu marcha favorita?": "No tengo una marcha favorita, soy un chatbot.",
    "¿cuál es tu sinfonía favorita?": "No tengo una sinfonía favorita, soy un chatbot.",
    "¿cuál es tu concierto favorito?": "No tengo un concierto favorito, soy un chatbot.",
    "¿cuál es tu sonata favorita?": "No tengo una sonata favorita, soy un chatbot.",
    "¿cuál es tu ópera favorita?": "No tengo una ópera favorita, soy un chatbot.",
    "¿cuál es tu aria favorita?": "No tengo un aria favorita, soy un chatbot.",
    "¿cuál es tu canción favorita?": "No tengo una canción favorita, soy un chatbot.",
    "¿cuál es tu álbum favorito?": "No tengo un álbum favorito, soy un chatbot.",
    "¿cuál es tu género musical favorito?": "No tengo un género musical favorito, soy un chatbot.",
    "¿cuál es tu instrumento musical favorito?": "No tengo un instrumento musical favorito, soy un chatbot.",
    "¿cuál es tu deporte favorito?": "No practico deportes, pero me gusta aprender.",
    "¿cuál es tu equipo favorito?": "No tengo un equipo favorito, soy un chatbot.",
    "¿cuál es tu jugador favorito?": "No tengo un jugador favorito, soy un chatbot.",
    "¿cuál es tu entrenador favorito?": "No tengo un entrenador favorito, soy un chatbot.",
    "¿cuál es tu estadio favorito?": "No tengo un estadio favorito, soy un chatbot.",
    "¿cuál es tu torneo favorito?": "No tengo un torneo favorito, soy un chatbot.",
    "¿cuál es tu liga favorita?": "No tengo una liga favorita, soy un chatbot.",
    "¿cuál es tu campeonato favorito?": "No tengo un campeonato favorito, soy un chatbot.",
    "¿cuál es tu copa favorita?": "No tengo una copa favorita, soy un chatbot.",
    "¿cuál es tu medalla favorita?": "No tengo una medalla favorita, soy un chatbot.",
    "¿cuál es tu trofeo favorito?": "No tengo un trofeo favorito, soy un chatbot.",
    "¿cuál es tu récord favorito?": "No tengo un récord favorito, soy un chatbot.",
    "como esta": "Estoy bien, gracias. ¿Y tú?",
    "quien es felipe gonzales": "Un amigo de mi creador",
    "quien es tu creador": "Luis Acosta",
    "¿cuantos años de experiencia tiene tu creador?": "Tiene 2 años y es un pro",
    "cual es el github de tu creador": "https://github.com/Luis712-byte"
}